app/Http/Controllers/User/HomeController.php

    public function index()
    {
        $data['betInvests'] = BetInvest::with('betInvestLog')->where('user_id',$this->user->id)->orderBy('id','desc')->limit(6)->get();
        $data['userBet'] = collect(BetInvest::with('betInvestLog')->where('user_id', $this->user->id)
            ->selectRaw('SUM(CASE WHEN status != 2 THEN invest_amount END) as totalInvest')
            ->selectRaw('SUM(CASE WHEN status = 1 THEN return_amount END) as totalReturn')
            ->selectRaw('COUNT(CASE WHEN status = 1 THEN id END) AS win')
            ->selectRaw('COUNT(CASE WHEN status != 2 THEN id END) AS totalBet')
            ->orderBy('id','desc')
            ->get()->toArray())->collapse();

        $dailyPayout = $this->dayList();

        BetInvest::where('user_id', $this->user->id)
            ->whereMonth('created_at', Carbon::now()->month)
            ->select(
                DB::raw('SUM(invest_amount) as totalInvest'),
                DB::raw('DATE_FORMAT(created_at,"Day %d") as date')
            )
            ->groupBy(DB::raw("DATE(created_at)"))
            ->get()->map(function ($item) use ($dailyPayout) {
                $dailyPayout->put($item['date'], round($item['totalInvest'], 2));
            });
---
select * from `bet_invests` where `user_id` = 7 order by `id` desc limit 6
select * from `bet_invest_logs` where `bet_invest_logs`.`bet_invest_id` in (0)
select SUM(invest_amount) AS totalInvest, SUM(return_amount) AS totalReturn, COUNT(CASE WHEN status = 1 THEN id END) AS win, COUNT(id) AS totalBet from `bet_invests` where `user_id` = 7 order by `id` desc
select SUM(invest_amount) as totalInvest, DATE_FORMAT(created_at,"Day %d") as date from `bet_invests` where `user_id` = 7 and month(`created_at`) = '09' group by DATE(created_at)

    public function fundHistory()
    {
        $funds = Fund::where('user_id', $this->user->id)->where('status', '!=', 0)->orderBy('id', 'DESC')->with('gateway')->paginate(config('basic.paginate'));
---
select count(*) as aggregate from `funds` where `user_id` = 7 and `status` != 0

    public function addFund()
    {
        if (session()->get('plan_id') != null) {
            return redirect(route('user.payment'));
        }

        $data['totalPayment'] = null;
        $data['gateways'] = Gateway::where('status', 1)->orderBy('sort_by', 'ASC')->get();
---
select * from `gateways` where `status` = 1 order by `sort_by` asc

    public function profile(Request $request)
    {
        $validator = Validator::make($request->all(), []);
        $data['user'] = $this->user;
        $data['languages'] = Language::all();
        $data['identityFormList'] = IdentifyForm::where('status', 1)->get();
        if ($request->has('identity_type')) {
            $validator->errors()->add('identity', '1');
            $data['identity_type'] = $request->identity_type;
            $data['identityForm'] = IdentifyForm::where('slug', trim($request->identity_type))->where('status', 1)->firstOrFail();
---
select * from `languages`
select * from `identify_forms` where `status` = 1
select * from `identify_forms` where `slug` = 'driving-license' and `status` = 1 limit 1