app/Http/Controllers/FrontendController.php

select `content_id`, `description` from `content_media` where `content_media`.`content_id` in (100, 101, 102)
select `id`, `name` from `contents` where `contents`.`id` in (100, 101, 102)
select `game_categories`.*, (select count(*) from `game_matches` where `game_categories`.`id` = `game_matches`.`category_id` and `status` = 1) as `game_active_match_count` from `game_categories` where `status` = 1 order by `game_active_match_count` desc
---
    public function index()
    {
        $templateSection = ['hero', 'contact-us'];
        $data['templates'] = Template::templateMedia()->whereIn('section_name', $templateSection)->get()->groupBy('section_name');

        $contentSection = ['slider'];
        $data['contentDetails'] = ContentDetails::select('id', 'content_id', 'description', 'created_at')
            ->whereHas('content', function ($query) use ($contentSection) {
                return $query->whereIn('name', $contentSection);
            })
            ->with(['content:id,name',
                'content.contentMedia' => function ($q) {
                    $q->select(['content_id', 'description']);
                }])
            ->get()->groupBy('content.name');
        $data['gameCategories'] = GameCategory::with(['activeTournament'])->withCount('gameActiveMatch')->whereStatus(1)->orderBy('game_active_match_count', 'desc')->get();

select `content_id`, `description` from `content_media` where `content_media`.`content_id` in (100, 101, 102)
select `id`, `name` from `contents` where `contents`.`id` in (100, 101, 102)
select `game_categories`.*, (select count(*) from `game_matches` where `game_categories`.`id` = `game_matches`.`category_id` and `status` = 1) as `game_active_match_count` from `game_categories` where `status` = 1 order by `game_active_match_count` desc
---
    public function tournament($id)
    {
        $contentSection = ['slider'];
        $data['id'] = $id;
        $data['contentDetails'] = ContentDetails::select('id', 'content_id', 'description', 'created_at')
            ->whereHas('content', function ($query) use ($contentSection) {
                return $query->whereIn('name', $contentSection);
            })
            ->with(['content:id,name',
                'content.contentMedia' => function ($q) {
                    $q->select(['content_id', 'description']);
                }])
            ->get()->groupBy('content.name');
        $data['gameCategories'] = GameCategory::with(['activeTournament'])->withCount('gameActiveMatch')->whereStatus(1)->orderBy('game_active_match_count', 'desc')->get();

select `content_id`, `description` from `content_media` where `content_media`.`content_id` in (100, 101, 102)
select `id`, `name` from `contents` where `contents`.`id` in (100, 101, 102)
select `game_categories`.*, (select count(*) from `game_matches` where `game_categories`.`id` = `game_matches`.`category_id` and `status` = 1) as `game_active_match_count` from `game_categories` where `status` = 1 order by `game_active_match_count` desc
---
    public function match($slug = null, $id)
    {
        $contentSection = ['slider'];
        $data['contentDetails'] = ContentDetails::select('id', 'content_id', 'description', 'created_at')
            ->whereHas('content', function ($query) use ($contentSection) {
                return $query->whereIn('name', $contentSection);
            })
            ->with(['content:id,name',
                'content.contentMedia' => function ($q) {
                    $q->select(['content_id', 'description']);
                }])
            ->get()->groupBy('content.name');
        $data['gameCategories'] = GameCategory::with(['activeTournament'])->withCount('gameActiveMatch')->whereStatus(1)->orderBy('game_active_match_count', 'desc')->get();

select `content_id`, `description` from `content_media` where `content_media`.`content_id` in (83, 84, 85)
select `id`, `name` from `contents` where `contents`.`id` in (83, 84, 85)
---
    public function about()
    {

        $templateSection = ['about-us', 'testimonial'];
        $data['templates'] = Template::templateMedia()->whereIn('section_name', $templateSection)->get()->groupBy('section_name');

        $contentSection = ['testimonial'];
        $data['contentDetails'] = ContentDetails::select('id', 'content_id', 'description', 'created_at')
            ->whereHas('content', function ($query) use ($contentSection) {
                return $query->whereIn('name', $contentSection);
            })
            ->with(['content:id,name',
                'content.contentMedia' => function ($q) {
                    $q->select(['content_id', 'description']);
                }])
            ->get()->groupBy('content.name');

select `content_id`, `description` from `content_media` where `content_media`.`content_id` in (86, 87, 88, 89, 90, 91)
select `id`, `name` from `contents` where `contents`.`id` in (86, 87, 88, 89, 90, 91)
---
    public function faq()
    {

        $templateSection = ['faq'];
        $data['templates'] = Template::templateMedia()->whereIn('section_name', $templateSection)->get()->groupBy('section_name');

        $contentSection = ['faq'];
        $data['contentDetails'] = ContentDetails::select('id', 'content_id', 'description', 'created_at')
            ->whereHas('content', function ($query) use ($contentSection) {
                return $query->whereIn('name', $contentSection);
            })
            ->with(['content:id,name',
                'content.contentMedia' => function ($q) {
                    $q->select(['content_id', 'description']);
                }])
            ->get()->groupBy('content.name');

select * from `languages` where `short_name` = 'ES' limit 1
---
    public function language($code)
    {
        $language = Language::where('short_name', $code)->first();