app/Http/Controllers/GameFetchController.php

select `id`, `name` from `game_tournaments` where `game_tournaments`.`id` in (3, 23, 28)
select `id`, `name`, `icon` from `game_categories` where `game_categories`.`id` in (4, 26)
---
                $query->where('status', 1);
            })
            ->whereHas('gameCategory', function ($query) {
                $query->where('status', 1);
            })
            ->orderBy('start_date', 'asc')->with([
                'gameTeam1' => function ($q) {
                    $q->select('id', 'name', 'image');
                },
                'gameTeam2' => function ($q) {
                    $q->select('id', 'name', 'image');
                },
                'gameTournament' => function ($q) {
                    $q->select('id', 'name');
                },
                'gameCategory' => function ($q) {
                    $q->select('id', 'name', 'icon');
                },
                'activeQuestions',
                'activeQuestions.activeGameOptions'
            ])->get()
            ->map(function ($query) {