app/Http/Controllers/GameFetchController.php

select * from `game_matches` where `status` = 1 and `tournament_id` = '3' and exists (select * from `game_teams` where `game_matches`.`team1_id` = `game_teams`.`id`) and exists (select * from `game_teams` where `game_matches`.`team2_id` = `game_teams`.`id`) and exists (select * from `game_tournaments` where `game_matches`.`tournament_id` = `game_tournaments`.`id` and `status` = 1) and exists (select * from `game_categories` where `game_matches`.`category_id` = `game_categories`.`id` and `status` = 1) order by `start_date` asc
---
            ]);
            // dd($fixture);

            GameMatch::updateOrCreate([
                'id'=>$fixture->fixture->id,
            ],[
                'id'=>$fixture->fixture->id,
                'team1_id'=>$fixture->teams->home->id,
                'team2_id'=>$fixture->teams->away->id,
                'start_date'=>date($fixture->fixture->date),
                'end_date'=>date($fixture->fixture->date),
                'category_id'=>'1',
                'tournament_id'=>$fixture->league->id,
                'status'=>1,
                'is_unlock'=>1
            ]);