app/Http/Controllers/Admin/BasicController.php

    public function index(Request $request)
    {
        $timeZone = timezone_identifiers_list();
        $control = Configure::firstOrNew();
---
select * from `configures` limit 1

    public function updateConfigure(Request $request)
    {
        $configure = Configure::firstOrNew();
---
select * from `configures` limit 1

        config(['basic.minimum_bet' => $reqData['minimum_bet']]);


        $configure->fill($reqData)->save();
---
update `configures` set `theme_mode` = '1', `refund_charge` = '5', `win_charge` = '0', `minimum_bet` = '5', `configures`.`updated_at` = '2022-09-20 13:08:45' where `id` = 1